In [ ]:
import pandas as pd

In [ ]:
df1=pd.DataFrame({'A':['A1','B1'], 'B':['B1', 'B2']}, index=[0,1])

In [ ]:
print(df1)

    A   B
0  A1  B1
1  B1  B2

In [ ]:
df2=pd.DataFrame({'A':['A2','B2'], 'B':['B2', 'B2']}, index=[0,1])

In [ ]:
print(df2)

    A   B
0  A2  B2
1  B2  B2

In [ ]:
frames=[df1,df2]

In [ ]:
resut=pd.concat(frames)

In [ ]:
print(resut)

    A   B
0  A1  B1
1  B1  B2
0  A2  B2
1  B2  B2

In [ ]:
result=pd.concat(frames, keys=['x','y','x'])

In [ ]:
print(result)

      A   B
x 0  A1  B1
  1  B1  B2
y 0  A2  B2
  1  B2  B2

In [ ]:
result.loc['y']

    A   B
0  A2  B2
1  B2  B2

In [ ]:
r=pd.concat([df1, df2], axis=1, join='inner')

In [ ]:
print(r)

    A   B   A   B
0  A1  B1  A2  B2
1  B1  B2  B2  B2

In [ ]:
r1=df1.append(df2, sort=False)

In [ ]:
print(r1)

    A   B
0  A1  B1
1  B1  B2
0  A2  B2
1  B2  B2

In [ ]:
import seaborn as sns
import numpy as np

In [ ]:
tips=sns.load_dataset('tips')

In [ ]:
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [ ]:
tips.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    category
 3   smoker      244 non-null    category
 4   day         244 non-null    category
 5   time        244 non-null    category
 6   size        244 non-null    int64
dtypes: category(4), float64(2), int64(1)
memory usage: 7.3 KB

In [ ]:
tips.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

In [ ]:
tips.groupby(['smoker', 'sex']).count()

               total_bill  tip  day  time  size
smoker sex
Yes    Male            60   60   60    60    60
       Female          33   33   33    33    33
No     Male            97   97   97    97    97
       Female          54   54   54    54    54

In [ ]:
tips.groupby(['sex', 'day']).count()

             total_bill  tip  smoker  time  size
sex    day
Male   Thur          30   30      30    30    30
       Fri           10   10      10    10    10
       Sat           59   59      59    59    59
       Sun           58   58      58    58    58
Female Thur          32   32      32    32    32
       Fri            9    9       9     9     9
       Sat           28   28      28    28    28
       Sun           18   18      18    18    18

In [ ]:
tips.groupby(['sex',  'smoker', 'total_bill']).sum()

                           tip  size
sex    smoker total_bill
Male   Yes    3.07         NaN   NaN
              5.75         NaN   NaN
              7.25        5.15   2.0
              7.51         NaN   NaN
              7.56         NaN   NaN
...                        ...   ...
Female No     45.35        NaN   NaN
              48.17        NaN   NaN
              48.27        NaN   NaN
              48.33        NaN   NaN
              50.81        NaN   NaN

[916 rows x 2 columns]

In [ ]:
tips.total_bill.sum()

4827.77

In [ ]:
tips_bill=tips.groupby(['sex', 'smoker'])[['total_bill', 'tip']].sum()
tips_tip=tips.groupby(['sex', 'smoker'])[['total_bill', 'tip']].sum()

In [ ]:
del tips_bill['tip']
del tips_tip['total_bill']

In [ ]:
tips_tip

                  tip
sex    smoker
Male   Yes     183.07
       No      302.00
Female Yes      96.74
       No      149.77

In [ ]:
tips_bill

               total_bill
sex    smoker
Male   Yes        1337.07
       No         1919.75
Female Yes         593.27
       No          977.68

In [ ]:
pd.merge(tips_bill, tips_tip, right_index=True, left_index=True)

               total_bill     tip
sex    smoker
Male   Yes        1337.07  183.07
       No         1919.75  302.00
Female Yes         593.27   96.74
       No          977.68  149.77

In [ ]:
pd.merge(tips_bill.reset_index(), tips_tip.reset_index(), on=['sex', 'smoker'])

      sex smoker  total_bill     tip
0    Male    Yes     1337.07  183.07
1    Male     No     1919.75  302.00
2  Female    Yes      593.27   96.74
3  Female     No      977.68  149.77

In [ ]:
pd.merge(tips_bill.reset_index(), tips_tip.reset_index())

      sex smoker  total_bill     tip
0    Male    Yes     1337.07  183.07
1    Male     No     1919.75  302.00
2  Female    Yes      593.27   96.74
3  Female     No      977.68  149.77

In [50]:
pd.merge(tips_bill.reset_index(), tips_tip.reset_index().head(2), how='left')

      sex smoker  total_bill     tip
0    Male    Yes     1337.07  183.07
1    Male     No     1919.75  302.00
2  Female    Yes      593.27     NaN
3  Female     No      977.68     NaN

In [52]:
pd.merge(tips_bill.reset_index().tail(3), tips_tip.reset_index().head(3), how='outer', indicator=True)

      sex smoker  total_bill     tip      _merge
0    Male     No     1919.75  302.00        both
1  Female    Yes      593.27   96.74        both
2  Female     No      977.68     NaN   left_only
3    Male    Yes         NaN  183.07  right_only